In [ ]:
#  Check the data type of 'InvoiceNo' field
type(df['InvoiceNo'][0])

int

In [ ]:
#  Convert 'InvoiceNo' field to string and verify whether the data type is converted or not.
df['InvoiceNo'] = df['InvoiceNo'].astype('str')
type(df['InvoiceNo'][0])

str

In [ ]:
# Use regex to find 'C' in the 'InvoiceNo' field
import re
df[df['InvoiceNo'].str.contains(pat = 'C', flags = re.IGNORECASE)]

       InvoiceNo StockCode  ... CustomerID         Country
141      C536379         D  ...    14527.0  United Kingdom
154      C536383    35004C  ...    15311.0  United Kingdom
235      C536391     22556  ...    17548.0  United Kingdom
236      C536391     21984  ...    17548.0  United Kingdom
237      C536391     21983  ...    17548.0  United Kingdom
...          ...       ...  ...        ...             ...
540449   C581490     23144  ...    14397.0  United Kingdom
541541   C581499         M  ...    15498.0  United Kingdom
541715   C581568     21258  ...    15311.0  United Kingdom
541716   C581569     84978  ...    17315.0  United Kingdom
541717   C581569     20979  ...    17315.0  United Kingdom

[9288 rows x 8 columns]

In [ ]:
#  Check total number of orders including cancelled orders.
df['InvoiceNo'].shape[0]

541909

In [ ]:
#  Remove cancelled invoices from the dataset
df = df[~(df['InvoiceNo'].str.contains('C', flags = re.IGNORECASE, regex = True))]
df

       InvoiceNo StockCode  ... CustomerID         Country
0         536365    85123A  ...    17850.0  United Kingdom
1         536365     71053  ...    17850.0  United Kingdom
2         536365    84406B  ...    17850.0  United Kingdom
3         536365    84029G  ...    17850.0  United Kingdom
4         536365    84029E  ...    17850.0  United Kingdom
...          ...       ...  ...        ...             ...
541904    581587     22613  ...    12680.0          France
541905    581587     22899  ...    12680.0          France
541906    581587     23254  ...    12680.0          France
541907    581587     23255  ...    12680.0          France
541908    581587     22138  ...    12680.0          France

[532621 rows x 8 columns]

In [ ]:
#  Obtain the number of missing or null values in df
df.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     134697
Country             0
dtype: int64

In [ ]:
#  Determine the percentage of null values in each column.
df.isnull().sum() * 100 / df.shape[0]

InvoiceNo       0.000000
StockCode       0.000000
Description     0.272990
Quantity        0.000000
InvoiceDate     0.000000
UnitPrice       0.000000
CustomerID     25.289465
Country         0.000000
dtype: float64

In [ ]:
#  Remove the null valued rows.
print(f"Before removing null values:\nNumber of rows = {df.shape[0]}")
df.dropna(inplace = True)
print(f"After removing null values:\nNumber of rows = {df.shape[0]}")

Before removing null values:
Number of rows = 532621
After removing null values:
Number of rows = 397924

In [ ]:
# Again obtain the number of null values in df.
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [ ]:
#  Check the data type of CustomerID column.
df['CustomerID'].dtype

dtype('float64')

In [ ]:
# Convert 'CustomerID' field to integer based categorical column.
df['CustomerID'] = df['CustomerID'].astype('int64').astype('category')
df['CustomerID'].dtype

CategoricalDtype(categories=[12346, 12347, 12348, 12349, 12350, 12352, 12353, 12354,
                  12355, 12356,
                  ...
                  18273, 18274, 18276, 18277, 18278, 18280, 18281, 18282,
                  18283, 18287],
                 ordered=False)

---

In [ ]:
#  Check the first 5 samples of the DataFrame
df.head()

  InvoiceNo StockCode  ... CustomerID         Country
0    536365    85123A  ...      17850  United Kingdom
1    536365     71053  ...      17850  United Kingdom
2    536365    84406B  ...      17850  United Kingdom
3    536365    84029G  ...      17850  United Kingdom
4    536365    84029E  ...      17850  United Kingdom

[5 rows x 8 columns]

In [ ]:
#  Obtain the the total purchase amount for the customers
df['TotalPrice'] = df['Quantity'] * df['UnitPrice']
df.head()

  InvoiceNo StockCode  ...         Country  TotalPrice
0    536365    85123A  ...  United Kingdom       15.30
1    536365     71053  ...  United Kingdom       20.34
2    536365    84406B  ...  United Kingdom       22.00
3    536365    84029G  ...  United Kingdom       20.34
4    536365    84029E  ...  United Kingdom       20.34

[5 rows x 9 columns]

In [ ]:
# Obtain the number of unique customers
df['CustomerID'].unique()

[17850, 13047, 12583, 13748, 15100, ..., 13436, 15520, 13298, 14569, 12713]
Length: 4339
Categories (4339, int64): [17850, 13047, 12583, 13748, ..., 15520, 13298, 14569, 12713]

In [ ]:
#  Obtain the Monetary information from the DataFrame
monetary_df = df[['CustomerID', 'TotalPrice']].groupby('CustomerID', as_index = False).sum()
monetary_df.rename(columns = {'TotalPrice' : 'Monetary'}, inplace = True)
monetary_df

     CustomerID  Monetary
0         12346  77183.60
1         12347   4310.00
2         12348   1797.24
3         12349   1757.55
4         12350    334.40
...         ...       ...
4334      18280    180.60
4335      18281     80.82
4336      18282    178.05
4337      18283   2094.88
4338      18287   1837.28

[4339 rows x 2 columns]

In [ ]:
#  Obtain the Frequency information from the DataFrame
frequency_df =  df[['CustomerID', 'InvoiceNo']].groupby('CustomerID', as_index = False).count()
frequency_df.rename(columns = {'InvoiceNo': 'Frequency'}, inplace = True)
frequency_df

     CustomerID  Frequency
0         12346          1
1         12347        182
2         12348         31
3         12349         73
4         12350         17
...         ...        ...
4334      18280         10
4335      18281          7
4336      18282         12
4337      18283        756
4338      18287         70

[4339 rows x 2 columns]

In [ ]:
# Create 'products_df' DataFrame.

products_df = pd.DataFrame({
    'Product_ID':[1001,1002,1003,1004,1005,1006,1007],
    'Product_name':['Watch','Bag','Shoes','Smartphone','Books','Cheese','Laptop'],
    'Category':['Fashion','Fashion','Fashion','Electronics','Study','Grocery','Electronics'],
    'Price':[299.0,1350.50,2999.0,14999.0,145.0,110.0,79999.0],
    })

products_df

   Product_ID Product_name     Category    Price
0        1001        Watch      Fashion    299.0
1        1002          Bag      Fashion   1350.5
2        1003        Shoes      Fashion   2999.0
3        1004   Smartphone  Electronics  14999.0
4        1005        Books        Study    145.0
5        1006       Cheese      Grocery    110.0
6        1007       Laptop  Electronics  79999.0

In [ ]:
# Create 'customer_df' DataFrame.

customer_df = pd.DataFrame({
    'Customer_ID':[1,2,3,4,5,6,7,8,9],
    'name':['Priyanshu','Rohit','Apeksha','Rohan','Karan','Divya','Abhinav','Isha','Vivek'],
    'age':[20,25,15,10,30,65,35,18,23],
    'Product_ID':[1001,0,1006,0,1003,1004,0,0,1007],
    'Purchased_Product':['Watch','NA','Oil','NA','Shoes','Smartphone','NA','NA','Laptop'],
   })

customer_df

   Customer_ID       name  age  Product_ID Purchased_Product
0            1  Priyanshu   20        1001             Watch
1            2      Rohit   25           0                NA
2            3    Apeksha   15        1006               Oil
3            4      Rohan   10           0                NA
4            5      Karan   30        1003             Shoes
5            6      Divya   65        1004        Smartphone
6            7    Abhinav   35           0                NA
7            8       Isha   18           0                NA
8            9      Vivek   23        1007            Laptop

In [ ]:
#  Use inner join to merge both DataFrames

pd.merge(products_df, customer_df, on='Product_ID', how = 'inner')

   Product_ID Product_name     Category  ...       name  age Purchased_Product
0        1001        Watch      Fashion  ...  Priyanshu   20             Watch
1        1003        Shoes      Fashion  ...      Karan   30             Shoes
2        1004   Smartphone  Electronics  ...      Divya   65        Smartphone
3        1006       Cheese      Grocery  ...    Apeksha   15               Oil
4        1007       Laptop  Electronics  ...      Vivek   23            Laptop

[5 rows x 8 columns]

In [ ]:
#  Use outer join to merge both DataFrames

pd.merge(products_df, customer_df, on='Product_ID', how = 'outer')

    Product_ID Product_name     Category  ...       name   age Purchased_Product
0         1001        Watch      Fashion  ...  Priyanshu  20.0             Watch
1         1002          Bag      Fashion  ...        NaN   NaN               NaN
2         1003        Shoes      Fashion  ...      Karan  30.0             Shoes
3         1004   Smartphone  Electronics  ...      Divya  65.0        Smartphone
4         1005        Books        Study  ...        NaN   NaN               NaN
5         1006       Cheese      Grocery  ...    Apeksha  15.0               Oil
6         1007       Laptop  Electronics  ...      Vivek  23.0            Laptop
7            0          NaN          NaN  ...      Rohit  25.0                NA
8            0          NaN          NaN  ...      Rohan  10.0                NA
9            0          NaN          NaN  ...    Abhinav  35.0                NA
10           0          NaN          NaN  ...       Isha  18.0                NA

[11 rows x 8 columns]

In [ ]:
#  Merge 'monetary_df' and 'frequency_df' DataFrames.
rfm_df = pd.merge(monetary_df, frequency_df, on='CustomerID', how = 'inner')
rfm_df.head()

  CustomerID  Monetary  Frequency
0      12346  77183.60          1
1      12347   4310.00        182
2      12348   1797.24         31
3      12349   1757.55         73
4      12350    334.40         17

In [ ]:
# : Obtain the last purchase date for each customer
recency_df = df[['CustomerID', 'InvoiceDate']].groupby('CustomerID', as_index = False).max()
recency_df.rename(columns = {'InvoiceDate': 'LastPurchaseDate'}, inplace = True)
recency_df

     CustomerID    LastPurchaseDate
0         12346 2011-01-18 10:01:00
1         12347 2011-12-07 15:52:00
2         12348 2011-09-25 13:13:00
3         12349 2011-11-21 09:51:00
4         12350 2011-02-02 16:01:00
...         ...                 ...
4334      18280 2011-03-07 09:52:00
4335      18281 2011-06-12 10:53:00
4336      18282 2011-12-02 11:43:00
4337      18283 2011-12-06 12:02:00
4338      18287 2011-10-28 09:29:00

[4339 rows x 2 columns]

In [ ]:
#  Obtain the last invoice date in the dataset.
df['InvoiceDate'].max()

Timestamp('2011-12-09 12:50:00')

In [ ]:
#  Obtain the present date i.e LastPurchaseDate + 1 day
present_date = df['InvoiceDate'].max() + pd.Timedelta("1 day")
present_date

Timestamp('2011-12-10 12:50:00')

In [ ]:
# Obtain the days since last purchase made by a customer
days_last_purchase = present_date - recency_df['LastPurchaseDate']
days_last_purchase

0      326 days 02:49:00
1        2 days 20:58:00
2       75 days 23:37:00
3       19 days 02:59:00
4      310 days 20:49:00
              ...
4334   278 days 02:58:00
4335   181 days 01:57:00
4336     8 days 01:07:00
4337     4 days 00:48:00
4338    43 days 03:21:00
Name: LastPurchaseDate, Length: 4339, dtype: timedelta64[ns]

In [ ]:
#  Extract days from datetime using 'dt.days' attribute
recency_days = days_last_purchase.dt.days
recency_days

0       326
1         2
2        75
3        19
4       310
       ...
4334    278
4335    181
4336      8
4337      4
4338     43
Name: LastPurchaseDate, Length: 4339, dtype: int64

In [ ]:
# Add 'recency_days' as column to the merged DataFrame 'rfm_df'.
rfm_df['Recency'] = recency_days
rfm_df

     CustomerID  Monetary  Frequency  Recency
0         12346  77183.60          1      326
1         12347   4310.00        182        2
2         12348   1797.24         31       75
3         12349   1757.55         73       19
4         12350    334.40         17      310
...         ...       ...        ...      ...
4334      18280    180.60         10      278
4335      18281     80.82          7      181
4336      18282    178.05         12        8
4337      18283   2094.88        756        4
4338      18287   1837.28         70       43

[4339 rows x 4 columns]